#include<stdio.h>
#include<stdlib.h>

int main()
{
	//整形提升的概念
	//一般来说是小于4个字节的类似char 存放的数值，我们用%d %u来格式化它输出就会存在整形提升
	//整形提升的概念是对于符号和无符号的
	//无符号的添加0
	//有符号的添加1
	//%u输出形式是读取补码的
	//%d的输出形式是读取原码
	//但是操作的都是补码（内存）

	char a = 128;
	printf("Ua = %u\n", a);
	printf("a = %d\n", a);
	//这块牵扯的概念是整形提升
	//0000 0000 0000 0000 0000 0000 1000 0000
	//1111 1111 1111 1111 1111 1111 1000 0000 --> %U
	//1000 0000 0000 0000 0000 0000 1000 0000 --> %d

	char b = -128;
	printf("\nUb = %u\n", b);
	printf("b = %d\n", b);//-128
	//1000 0000 0000 0000 0000 0000 1000 0000
	//1111 1111 1111 1111 1111 1111 0111 1111
	//1111 1111 1111 1111 1111 1111 1000 0000 -->-128的补码
	//1111 1111 1111 1111 1111 1111 1000 0000 -->%u
	//1000 0000 0000 0000 0000 0000 1000 0000 -->%d

	unsigned char c = 128;
	printf("\nUc = %u\n", c);
	printf("c = %d\n", c);
	//0000 0000 0000 0000 0000 0000 1000 0000
	//0000 0000 0000 0000 0000 0000 1000 0000// -->%u
	//0000 0000 0000 0000 0000 0000 1000 0000// -->%d

	unsigned char d = -128;
	printf("\nd = %u\n", d);
	printf("d = %d\n", d);
	
	getch();
	return 0;
}